<template>
	<div>
		<!--固定部分-->
		<div class="layer_scoller">
			<div class="layer_scoller_item" @click="autoRead()">自动阅读</div>
			<div class="layer_scoller_item" @click="stopAuto()">停止</div>
			<div class="layer_scoller_item" @click="backTop()">返回顶部</div>
		</div>
		<div class="content_scoller">
			夜，结束了一天的喧嚣后安静下来，伴随着远处路灯那微弱的光。风，毫无预兆地席卷整片旷野，撩动人的思绪万千。星，遥遥地挂在天空之中，闪烁着它那微微星光，不如阳光般灿烂却如花儿般如痴如醉。

　　——题记

　　欲将沉醉换悲凉，清歌莫断肠。这混乱的尘世，究竟充斥了多少绝望和悲伤。你想去做一个勇敢的男子，为爱，为信仰，轰轰烈烈的奋斗一场。你周身充斥着无人可比的灵气和光芒。你有着与伟人比肩的才气和名声，你是那样高傲孤洁的男子。你的一寸狂心未说，已经几度黄昏雨。

　　曾经以为，相爱的人一定要相守，只有相守，情感才能长久。可是，此岸和彼岸只不过是空间的差距，却无法拉长心灵的距离。

　　时光荏苒，岁月无声。日子不紧不慢的如涓涓溪水静静的流去，而从身边流去的只有时光，沉淀下来的是与你一路相伴的幸福和快乐，温馨和安暖。于我，在这个凋零都感受到诗意横溢的秋，只想做一件事，拈一片绯红的枫叶，轻轻地刻上我的心语。对信仰，是我今生永不改变的主题！而后，幸福的寄往有你的那个城市。从此，在我心里，于我的生命里，轻握你许的安暖，静静地在岁月的彼岸，为你守候一世永恒！

　　一段情，反复的掂量，最后加深了岁月的绵长。一路追赶里，一路追忆里，最后得到的是什么，最后又失去的是什么。或许，只有我们在静思的时候才会明白，这路的追忆里，我们得到的快乐往往比痛苦要少。当相思成殇的时候，除了对月徒悲叹之外，什么也不曾抓到。

　　一直执着于生命的简约格调，只愿用一颗淡然的心看云卷云舒，看季节更迭。许多不合时节的事物，必然会被光阴遗落，就像曾经繁茂的秋叶，待生命枯竭，终将脱离叶脉的相系相牵。而我，一直在这里，抖落一身的负累，永恒以树的姿态站立于季风中，昂首向着那无边温暖的碧蓝晴空。

　　夜幕降临了，春雨柔柔的亲吻着薄如蝉翼的纱帘，有节奏的淅沥在窗棂上，更增添了无限的意念。意念中的我，在幸福和恬淡中，漫捻心弦化为若水般的轻柔曼妙在深情的雨夜里。此刻，窗外的雨不再是清冷的秋雨了，在我的眸里是一种柔软，似撒娇少女的情怀，是怜、是爱、是柔、是润在我的心里是一种憧憬，憧憬着一份美好的未来，与你相拥在花雨飘飞的时节，让爱情肆意的怒放在油纸伞下，青石边，丁香小巷这样的心境，这样的时光，这样的时刻，心不经意间便醉了、醉了、醉在这如曼妙轻盈舞步的秋雨中

　　晚霞破月的天际，依旧映红了归家的路途，流浪了好久的笔调写满了疲倦的素笺，伴着枯萎的憔悴，与年华斑驳的碎影相逢，溅起涟漪在心田的几缕游丝浅叹，让年华牵住执笔的手，静听潺潺流水；波动在逐流的心海，唤名为；婆娑年华，勾勒了谁的斑驳唯有情醉琉璃一宿，又是一个不眠的夜。

　　真正的相爱，是人在千里，却梦魂相依；真正的相爱，是岁月流转，却不离不弃；真正的相爱，是彼此付出，却无怨无悔。

　　樱花有单樱和双樱，她们绽放时满树灿烂，清香扑鼻，单樱白的如雪如云，双樱色彩如火似霞。但是无论是单樱还是双樱，她们盛开的时间都不长，二十多天的光景，开的绚丽多彩、满树烂漫，落得星星瓣瓣，匆匆忙忙。

　　深秋还远，徐徐的风吹着，却也有了几分萧瑟，春天，不仅有满天飘飞的花儿，还有到处弥散着花的幽香。随着秋韵渐渐浓郁起来，院子里的花便盛开了，整个院子里香气四溢，溢漫着甜丝丝的味儿。金灿的花儿一串串、一撮撮，重重叠叠簇涌着点缀在茂密的绿叶之间，温温暖暖象极了一个个孩子的笑脸，仿佛是给这温暖的春天注入了一道亮丽的风景。

　　指尖轻触玻窗，嗤嗤的响声，惊动了脆弱的心脏，一阵阵的酸楚，像浪潮般袭来，若果这样酸酸的痛可以代替撕心裂肺，那就让他长久点，这样时间会把我忘记，这样便可躲在这里，让那些软弱手舞足蹈，让那些脆弱和不堪拼命娱乐，让那颗紧绷的心，少少松弦。

　　曾过往，伊颜纯美无暇，如玉般璀璨，许多人像发现了财富，紧抱于怀，怜香般害怕失去。那时，遇见你的是洗礼过后的悔过者，只懂怜香，而不懂惜玉，再璀璨也掩盖不了他身上久积的灰尘，铸造不了你，也成就不了他，于是乎，迷糊坚固了戏剧化的情谊，疼只是简单的疼。

　　有人曾说，会白首不相离。可是终究一口空言，转眼，便抛之彼岸。可是，我却一直相信着。然后，在追逐的沿途，荆棘布满，却一直从未低头

　　原来有些等待是不值得的，那么多年换来的却是沧海桑田，我们只是沧海一粟，不能左右命运给予的奇迹与苦楚，面对些许，能做的也许只剩下了等待，可是等待却又是需要勇气，更要有勇气来承担与等待而来的结果大相径庭的结果。

　　思绪渺渺，发怀古之悲情，世间种种，诱愁之决堤，三山五岳，撼天地之威名，流水之昌吉，涓涓之柔情，不禁闲情满溢。

　　人生自是有情痴，此恨不关风与月。谁为谁真情缱绻？谁为谁痴傻疯狂？谁为谁望穿秋水？谁为谁痛彻心扉？都是你我解不开的白线团。无缘何生斯世，有情能累此生。

　　相思成为了很多人生命里的一种自我安慰，在月圆的时候无尽思念，在月缺的时候无限惆怅，想念着岁月里和情有关的所有悲欢离合。在情感的世界里，我们一直带着所有的铿锵前行，不管风雨肆虐，不管风和日丽。

　　染窗前。那堪清风曲径，不似甚似还满。份外湮留韶华，时节正乱红，空留余恨。淡眉醉眼，红妆轻粉，旧时依恋尘缘。只皓月朗朗，乾坤转，故国山川。次第红颜，疑是讴歌回畔。

　　生命中；总有太多的遗憾要留给回忆，年华里；屡不清的斑驳，总是勾勒了无数支离破碎的心伤。太多的执着所放不下，只是；那一份不屈的痛过，不期而遇的却是最美的意外。文字依旧可以华美朴实，年华不可唯美梦境，快乐不是一件不可奢侈的事情，忧伤，而往往是一度的颓废。

　　人生的路途，经历无数的驿站之后，总会出现陌生或熟悉的风景。时间所说的过客，只是注定走过的人和事，没有太多是刻意要去记住或淡忘的。铺就在黑白交错里的，无非就是忧伤曾穿越过的黑暗，在记忆的角落里，诉说了全部的待续。那些停驻在指尖的薄凉，是曾绽放在年华里的微碎。

　　指间年华，渲染着无暇斑驳的彩塑，悲伤的城池依旧提笔挥墨，画下四季风吹过的无痕。微笑掩饰了寂寞过的眼泪，是因为，在婆娑的年华里，聆听着没有人的相伴相知。那些了不断的往事，是梦绕在悲伤情愫深处，盈满心扉的最初和凝眸的叹息。终不过似水流年，清风凄语，唯独旧梦难拾。
	当清晨的一缕阳光透过窗帘上的空隙映照在沉睡的脸庞时，微微张开的双眼朦胧地注视着周遭的一切，新的一天悄然而至。

　　——题记

　　时光的单车飞快驶去，岁月的倒影也将消失，白天与黑夜不停的交替，轮回的四季斑驳了谁的岁月，蹉跎了谁的年华。一个人静静地与岁月交错，于平淡之中细细体会生活的深意，去注视，去聆听，去感受那些带着希望的别离以及那些经受沧桑的相逢，不论时光如何飞转，那些落花一样的往事，依然鲜活地存在于我的脑海之中。当岁月和美丽的回忆已成为风中的叹息，我们伤感的眼里也许依然残存旧时的泪痕，模糊了视线，不敢轻易触碰。

　　生活的列车慢慢的前进，有些人下去，也有人上去，不慌不忙的过着行云流水的日子，有的人知道自己的前方在哪里停靠，生活充实而安逸，有些人庸庸碌碌的过着不起波澜的日子，每天无头鸟似的瞎忙，朦胧的眼神向世界宣告着昏暗思想，一个个皮囊悬浮在空气中，没有生机的灵魂过着糜烂的时间。没有归属，无处生根。有时我们在迷茫青春的时候，日子也慢慢地溜走，不留一点痕迹。

　　时光不可阻挡，岁月交错中总要有些思量。人生只有在不短的思考中才会有所进步，有所追求，有了目标的人生才不会孤独和无助，只有让自己的心静下来时一些前方的东西才会明朗的展现在我们的面前。让我们不再迷惑于为所谓的挣扎中，谁的年华没有色彩，谁的青春没有耀眼的光芒，只是在岁月的长河里我们的选择不同，所得到的结局就不同，每个人都需要努力才会得到一切自己所要追求的东西和梦想。

　　生命无常，人生苦短，记忆的时光中我们匆匆走过，走过喧嚣，走过孤寂，时光无情地带走了我们的青春年少，还好我们都在坚持着内心的宁静，岁月的年轮缓缓的从我们身边碾过，往事一幕幕铺陈，让我的生活回忆不至于那么的枯燥，一些美好的记忆还依然鲜活地根植在我的脑海之中。消逝不去，本不该怀旧的年纪，可是我们学不会遗忘，日日夜夜的想念，带着些许的小寂寞，心有不甘常常在无人的街角大声的长啸，发泄着内心的声音，有时候我们会选择相信宿命，认为人与人之间的相遇，就像是上天早已做了安排，人谁也逃不过岁月时光刻下的印迹。

　　时光荏苒，蹉跎了谁的年华，匆匆行走的岁月长河中，有些人只顾着追寻他人的脚步，忘记了自己的方向，忘记了自己的目标和理想，有些人几顾思量不敢走出自己的道路，因而迷失了方向。迷失了自己。有些人默默坚守，把青春的岁月包裹在温热的怀里，载着它踏上梦想的征途，不留一丝遗憾。不留一点别人靠近的距离，就像是陈孝正为自己规划的一厘米的差距，人生没有从头来过的权利。亦没有后悔的权利，做过的事情，不管有些怎样的结局都会成为过往，我们纵使一味的活在过去的时光里也不会改变一点点发生的故事，向着远方，努力的看看前方的路才是对我们自己的肯定，只有心存希望，才会有拼搏的勇气，才有希望去走更远的路，因为值得，所以一路前行，

　　那一路上的心酸往事，慢慢的沉淀在内心平和的深处！
	一叶落便知秋意浓，即使江南的绿色褪色之期晚了几许，南飞的大雁也会在天空一会儿排成一字，一会儿排成人字，秋天真的来了，中秋真的来了，国庆真的来了。

　　秋天，是一个丰硕的季节，它孕育着收获。

　　节日，是一个相聚的守候，它意味着团圆。

　　在这个萧瑟的天空下，节日只会提醒游子该回家了，看看久别的故土，看看年迈的父母，看看自己的过往；但是现实的境遇却让我们无法脱身，我们只能思念、感叹，每逢佳节倍思亲。

　　年年岁岁花相似，岁岁年年人不同。转眼，我们已经长大，离开了父母亲人，离开了学校师生，离开了书生意气的轻狂，开始学会一个人的生活，向大人的方向一步步的跟进。岁月在流逝，阅历随之增长，思乡之情越发疯狂的蔓延，就连睡梦呓语都是方言的味道。看的故事多了，心中对母爱、对父爱、对乡情有了更为独特的情愫，每逢佳节便撩动我多愁善感的心，思亲之情犹如海浪澎湃着我难以平静。

　　慈母手中线，游子身上衣。多少年过去了，我一直穿着母亲手工制作的鞋垫，从春花到秋实，从寒来至暑往，走完四季的轮回；从儿时母亲手工做的棉鞋到现在自己买的运动鞋，鞋垫陪我走完了懵懂的青春。去年的一天，母亲打电话问我穿多大的鞋，她说再给我做十双。我疑惑的问母亲为什么要做那么多，我穿不完。母亲说她眼睛看不清楚了，这是最后一次给我做鞋垫了，多做几双，多穿几年。听到这里我不禁留下了眼泪，瞬间感觉母亲已经老了，而我却远在千里之外不能尽孝。月有阴晴圆缺，人有悲欢离合，家乡发生了很多的事，电话成了我与亲人的寄托，虽然电话中父母的声音没有太大的变化，但是我脑中总会浮现他们日益憔悴的容颜。

　　夜深难眠的时候，我就会走上阳台，看看这个霓虹映衬的不夜城。看着高耸的楼房，看着明亮的月，看着静静夜。夜风带来阵阵桂花的余香，我似乎在花香里闻到了家乡桂花酒的味道，听见了家乡河水流淌的声音，各种野鸟的怪叫，还有父亲夜里的咳嗽。家、家乡、亲人都在记忆中，都在心中，平日里他们平静的像湖水，每当在团圆的时候便激起千层浪，不停地叩打着游子的心门。

　　又是一年月圆时，又是一年团聚日，常回家看看，父母早已在不知不觉中慢慢的老去，他们要求并不高，全家团圆便是福。不要让自己暂时的借口成为不回家的理由，留下子欲养而亲不待的终身遗憾。
		</div>
	</div>
</template>

<script>
	export default{
		data(){
			return{
				autoFlag:true, //自动阅读标志
				timeFlag:0, //计时器标志
			}
		},
		components:{},
		created(){},
		mounted(){},
		methods:{
			autoRead(){
				if(this.autoFlag){
					this.timeFlag = setInterval(()=>{
						scrollBy(0,1)
					},20);
					this.autoFlag = false;
				}
			},
			stopAuto(){
				clearInterval(this.timeFlag);
				this.autoFlag = true;
			},
			backTop(){
				scrollTo(0,0);
			}
		}
	}
</script>

<style scoped="scoped">
	.layer_scoller{
		position: fixed;
		top: 50%;
		right: 0;
		width: 120px;
		height: 210px;
		margin-top: -105px;
	}
	.content_scoller{
		width: 80%;
		height: auto;
		margin-left: 10%;
		line-height: 40px;
		font-size: 17px;
	}
	.layer_scoller_item{
		height: 70px;
		line-height: 70px;
		text-align: center;
	}
</style>